/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "לומדת בטיחות";

// אובייקט המכיל את כל המידע של הלומדה הכולל את התוכן, השאלות לכל נושא וכמות השאלות שיילקח מכל נושא למבחן
const DATA = { 
    // נושא
    'בה"ד 6': {
        "icon":  "../assets/images/icons/bhd6.png",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'במה תלוי המשקל שעובד יכול להרים?',
                ans1: 'גיל, גובה ומבנה הגוף.',
                ans2: '.מבנה גוף ומשקלו של החייל',
                ans3: ' מבנה גוף , מין, גיל העובד.',
                ans4: 'ביכולת העובד להרים אותו.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם יכול עובד להרים משקל גדול מהמותר בטבלאות שראית בסרטון?',
                ans1: 'כן בהחלט, כל אדם והיכולת שלו.',
                ans2: 'כן בהחלט, תלוי במצב הגוף של העובד.',
                ans3: 'חל איסור מוחלט לחרוג מהמשקלים המצויינים בטבלה.',
                ans4: 'במקרים מסויימים כשאין ברירה, ניתן להרים יותר מהמותר.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם מפקד יכול להורות לחייל להרים משקל גדול מהמותר?',
                ans1: 'כן בהחלט, זהו תפקידו של מפקד.',
                ans2: 'לא.',
                ans3: 'כן, במקרים מסויימים כשממש חייב.',
                ans4: 'לא, אלא אם נעזר בחייל נוסף והמשקל מתחלק לנורמה תקינה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'עליך להעמיס משקל גדול למשאית הובלה שהוזמנה לך מראש ע"י המפקד. כיצד תפעל?',
                ans1: 'אעמיס המשקל הנדרש.',
                ans2: 'אבקש עזרה מחבר כדי לחלק את המשקל לערכים המותרים להרמה.',
                ans3: 'במידה והמשקל גדול מהמותר אשתמש במלגזה או מכונת הרמה .',
                ans4: 'תשובות ב וג נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'על מי חלה אחריות לספק ציוד הרמה להרמת משקלים גדולים?',
                ans1: 'מפקד או מי מטעמו מחוייבים לספק ציוד הרמה ולהדריך העובדים להשתמש בו.',
                ans2: 'על העובד חלה חובה להשתמש בציוד זה לאחר שקיבל הדרכה ומכיר את הסיכונים.',
                ans3: ' אין כל חובה לספק ציוד הרמה בבסיסי צה"ל.',
                ans4: 'תשובות א ו ב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },

        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "טלטול והרמה": {
                "חסר שקופית 16": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid6.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            }
        },
    },
    // נושא
    'בה"ד 7': {
        "icon":  "../assets/images/icons/bhd7.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: 'אצלצל אליו ואודיע לו שלא תודרכתי.',
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: 'אני מספיק בוגר לדאוג לעצמי ולהזהר.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'לפני מעבר חצייה עליך בתוך נהג ?',
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: 'להאט ולהסתכל שאף אחד לא רוצה לחצות.',
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)',
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: 'כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.',
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: 'בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?',
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: 'אעצור לישון בצד הדרך כדי להשלים שעות שינה.',
                ans3: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                ans4: 'אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: 'מותר לשתות כוסית על בטן מלאה.',
                ans3: 'בירה לא באמת משפיעה על הנהיגה שלי.',
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך? ',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'הגדר מהי עבודה בגובה:',
                ans1: "מקום ממנו עלול ליפול אדם מגובה העולה על 2 מ'.",
                ans2: 'תשובה א נכונה, ובנוסף אם לא הותקן מעקה, אין אמצעי גישה בטוחים, הטיית הגוף מעבר למעקה, ועבודה על בימה מתרוממת ניידת או סל להרמת אדם.',
                ans3: 'כל עבודה על סולם גבוה, פיגום או בימה.',
                ans4: 'כל מקום מעל פני הקרקע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'מהם הכללים הבסיסיים לעבודה על סולם?',
                ans1: 'קשור את הסולם.',
                ans2: 'בקש מעוזר העבודה שיחזיק את הסולם חזק, השתמש בנעלי בטיחות ובקסדה.',
                ans3: 'בדוק את תקינות ותקן הסולם, רתום אותו למבנה יציב, השתמש בציוד מגן אישי: נעלי בטיחות, קסדה ורתמה המעוגנת באמצעות מערכת ריסון לקו חיים, מערכת מיקום ותמיכה.',
                ans4: 'רתום את העובד.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי רשאי לעבוד עבודה בגובה?',
                ans1: 'חייל שהוסמך והודרך לעבוד בגובה ע"י מדריך מוסמך.',
                ans2: 'כל חייל צה"ל מוסמך לעבוד בגובה.',
                ans3: 'רק חיילים שעברו תדריך בטיחות לפני עבודה בגובה.',
                ans4: 'אף תשובה אינה נכונה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            },
            "גובה": {       
                "גובה": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid8.mp4",
                    }
                ]
            }
        }
    },
    // נושא
    'בה"ד 10': {
        "icon":  "../assets/images/icons/bhd10.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            }
        },
    },
    // נושא
    'בה"ד 11': {
        "icon":  "../assets/images/icons/bhd11.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            }
        },
    },
    // נושא
    'בה"ד חינוך': {
        "icon":  "../assets/images/icons/bhdHinuch.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            }
        },
    },
    // נושא
    'בה"ד 13': {
        "icon":  "../assets/images/icons/bhd13.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            }
        },
    },
    // נושא
    'בה"ד 20': {
        "icon":  "../assets/images/icons/bhd20.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'במה תלוי המשקל שעובד יכול להרים?',
                ans1: 'גיל, גובה ומבנה הגוף.',
                ans2: '.מבנה גוף ומשקלו של החייל',
                ans3: ' מבנה גוף , מין, גיל העובד.',
                ans4: 'ביכולת העובד להרים אותו.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם יכול עובד להרים משקל גדול מהמותר בטבלאות שראית בסרטון?',
                ans1: 'כן בהחלט, כל אדם והיכולת שלו.',
                ans2: 'כן בהחלט, תלוי במצב הגוף של העובד.',
                ans3: 'חל איסור מוחלט לחרוג מהמשקלים המצויינים בטבלה.',
                ans4: 'במקרים מסויימים כשאין ברירה, ניתן להרים יותר מהמותר.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם מפקד יכול להורות לחייל להרים משקל גדול מהמותר?',
                ans1: 'כן בהחלט, זהו תפקידו של מפקד.',
                ans2: 'לא.',
                ans3: 'כן, במקרים מסויימים כשממש חייב.',
                ans4: 'לא, אלא אם נעזר בחייל נוסף והמשקל מתחלק לנורמה תקינה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'עליך להעמיס משקל גדול למשאית הובלה שהוזמנה לך מראש ע"י המפקד. כיצד תפעל?',
                ans1: 'אעמיס המשקל הנדרש.',
                ans2: 'אבקש עזרה מחבר כדי לחלק את המשקל לערכים המותרים להרמה.',
                ans3: 'במידה והמשקל גדול מהמותר אשתמש במלגזה או מכונת הרמה .',
                ans4: 'תשובות ב וג נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'על מי חלה אחריות לספק ציוד הרמה להרמת משקלים גדולים?',
                ans1: 'מפקד או מי מטעמו מחוייבים לספק ציוד הרמה ולהדריך העובדים להשתמש בו.',
                ans2: 'על העובד חלה חובה להשתמש בציוד זה לאחר שקיבל הדרכה ומכיר את הסיכונים.',
                ans3: ' אין כל חובה לספק ציוד הרמה בבסיסי צה"ל.',
                ans4: 'תשובות א ו ב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'בין חובותיו של העובד במקום העבודה ניתן למנות:',
                ans1: 'שימוש בציוד מגן אישי ושמירה על תקינותו.',
                ans2: 'התייצבות להדרכות ובדיקות רפואיות.',
                ans3: 'שימוש בהתקני הבטיחות שסופקו לו.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'בדיקת בודק מוסמך למכונת הרמה ולאביזרי הרמה (בהתאמה) תתבצע כל:',
                ans1: '14 חודשים, 6 חודשים.',
                ans2: 'אחת לשנה.',
                ans3: 'טרם שימוש ראשון ואחת ל14 חודשים, טרם שימוש ראשון ואחת ל6 חודשים.',
                ans4: 'אחרי כל קלקול ותיקון.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מהן דרכי הפגיעה האפשריות לאדם מחומרים מסוכנים?',
                ans1: 'התזה על בגדי העבודה ועל ציוד המגן האישי.',
                ans2: 'בליעה, נשימה, התזה לעור, התזה לעיניים.',
                ans3: 'בגליון הבטיחות לחומר (MSDS) שבו מפורטות התכונות הכימיות והפיזיקליות של כל חומר.',
                ans4: 'נגיעה.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'עבודה לאורך שנים בתנאים לא נוחים מבחינה ארגונומית עלולה לגרום ל:',
                ans1: 'אי נוחות מתמשכת.',
                ans2: 'תאונת עבודה.',
                ans3: 'פגיעות מיקרוטראומה מצטברות אשר עלולות להתבטא בין היתר גם בבעיות שריר ושלד.',
                ans4: 'מחלות מקצוע.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'מהן ההנחיות לתנועה כללית בבה"ד?',
                ans1: 'לחצות כבישים בריצה, לפני שתגיע מלגזה או משאית בדרך.',
                ans2: 'לנוע במהירות על מנת שמשאות לא יפלו עלי.',
                ans3: 'לנוע רק על מדרכות, לחצות במעברי חציה (במידה וישנם), אין לעבור מתחת למטען מונף.',
                ans4: 'לנוע לכיוון התקן בדרך הקצרה ביותר.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'בנהיגה בשטח תפעולי בתוך הבסיס:',
                ans1: 'חוקי התעבורה אינם חלים על הנהג.',
                ans2: 'חוקי התעבורה חלים על כל נוהג בכל רכב, מהירות הנסיעה על פי התמרורים.',
                ans3: 'יש לנסוע לאט.',
                ans4: 'יש לנסוע לכיוון המתקן בדרך הקצרה ביותר.',
                correctAns: "ans2"
            },

        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "טלטול והרמה": {
                "חסר שקופית 16": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid6.mp4",
                    }
                ]
            },
            "בטיחות בסדנאות": {       
                "בטיחות בסדנאות": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid8.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            },
        },
    },
    // נושא
    'מפקדות': {
        "icon":  "../assets/images/icons/Hadraha.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אלך הביתה רגיל, זה הסופ"ש שלי.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, אני לא צריך תדר"צ.',
                ans4: "אני מספיק בוגר לדאוג לעצמי ולהזהר.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לגעת בטלפון הנייד בנסיעה ברכב פרטי?(אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן. ברכב פרטי מותר לדבר בנייד, זה לא בצבא.",
                ans3: 'מותר לדבר רק בדיבורית תקנית כשהמכשיר מוחזק במתקן קבוע.',
                ans4: "בשום פנים ואופן לא. אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אסע לאט, אעצור לרענונים ואסיים את המשימה.',
                ans2: "אעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.",
                ans4: 'אדאג שיהיה איתי מפקד עירני ואסע בזהירות.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: "מותר לשתות כוסית על בטן מלאה.",
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'כעיקרון אסור לשתות, אבל כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך, אבל הסופ"ש בפתח.',
                ans3: 'אדליק חום באוטו כדי להפשיר אדים.',
                ans4: 'אסע רגיל. כמובן אשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו -מה עליך לעשות?',
                ans1: 'אקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 17:00.',
                ans3: 'אין צורך באישור, רק לקחת מפקד נסיעה.',
                ans4: 'אדאג שהנהג ישן מספיק ואסע איתו למיון.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל?(רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. האופנוע שלי ואין צורך באישור.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי להגיע עם אופנוע.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אין מה לעשות, מה שנשפך אי אפשר לאסוף.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי(שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'מפקד היחידה בה קרה האירוע.',
                ans3: 'ממונה הגנ"ס יחידתי.',
                ans4: 'תשובות א וב נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid1.mp4"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid2.mp4"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid3.mp4"
                    },
                ]
            },
            "בטיחות באש": {
                "חסר שקופית 12": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid4.mp4",
                    }
                ]
            },
            "הגנת הסביבה": {
                "חסר שקופית 14": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid5.mp4",
                    }
                ]
            },
            "בטיחות בחשמל": {       
                "חסר שקופית 18": [
                    {
                        cardType: "video",
                        video: "../assets/images/videos&photos/vid7.mp4",
                    }
                ]
            }
        },
    },
};



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}
CARD_TYPES.listDots3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}
CARD_TYPES.listNumbers3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}